from telegram import (
    Update, InlineKeyboardMarkup, InlineKeyboardButton, ReplyKeyboardMarkup
)
from telegram.ext import (
    ApplicationBuilder, CommandHandler, MessageHandler,
    CallbackQueryHandler, ContextTypes, filters
)

# 🔑 Telegram токен
TELEGRAM_TOKEN = "8377121179:AAEZyFml1sFSLY1VYnFyteGTVrRwBdySZbc"

# 👑 Admin ID
ADMIN_ID = 6630091360  # o'z ID'ingizni yozing

# 📋 Вазирликлар рўйхати
vazirliklar = [
    ["Инвестициялар, саноат ва савдо вазирлиги"],
    ["Иқтисодиёт ва молия вазирлиги"],
    ["Тоғ-кон саноати ва геология вазирлиги"],
    ["Қурилиш ва уй-жой коммунал хўжалиги вазирлиги"],
    ["Камбағалликни қисқартириш ва бандлик вазирлиги"],
    ["Олий таълим, фан ва инновациялар вазирлиги"],
    ["Мактабгача ва мактаб таълими вазирлиги"],
    ["Экология, атроф-муҳитни муҳофаза қилиш ва иқлим ўзгариши вазирлиги"],
    ["Спорт вазирлиги"],
    ["Қишлоқ хўжалиги вазирлиги"],
    ["Сув хўжалиги вазирлиги"],
    ["Рақамли технологиялар вазирлиги"],
    ["Адлия вазирлиги"],
    ["Транспорт вазирлиги"],
    ["Маданият вазирлиги"],
    ["Мудофаа вазирлиги"],
    ["Энергетика вазирлиги"],
    ["Соғлиқни сақлаш вазирлиги"],
    ["Ташқи ишлар вазирлиги"],
    ["Ички ишлар вазирлиги"],
    ["Фавқулодда вазиятлар вазирлиги"]
]

# 🗂 Маълумотлар базаси
malumotlar = {
    "Адлия вазирлиги": {
        "tuzilmasi": """🧩Адлия вазирлиги тузилмаси: 
1. Қонунчилик департаменти 
2. Жиноий, маъмурий ва ижтимоий қонунчилик бошқармаси 
3. Иқтисодий қонунчилик бошқармаси 
4. Идоравий нормативҳуқуқий ҳужжатларни давлат рўйхатидан ўтказиш бошқармаси 
5. Қонунчиликни тизимлаштириш ва тартибга солиш таъсирини баҳолаш бошқармаси 
6. Миллий қонунчиликни Жаҳон савдо ташкилоти битимларига уйғунлаштириш бошқармаси 
7. Қонунчиликни таҳлил қилиш ва тартибга солиш таъсирини баҳолаш институти 
8. Адолат миллий ҳуқуқий ахборот маркази 
9. Тошкент давлат юридик университети 
10. Академик лицейлар 
11. Ҳуқуқни қўллаш департаменти 
12. Ҳуқуқни қўллашни методик таъминлаш бошқармаси 
13. Ҳуқуқни қўллаш амалиётини ўрганиш бошқармаси 
14. Ҳуқуқий ахборот бошқармаси 
15. Ўзбекистон Республикаси Президенти ҳужжатлари ижросини назорат қилиш бошқармаси 
16. Инсон ҳуқуқларини ҳимоя қилиш бошқармаси 
17. Юридик таълим ва судэкспертиза бошқармаси 
18. Х. Сулаймонова номидаги Республика судэкспертиза маркази 
19. Юридик кадрларни қайта тайёрлаш ва малакасини ошириш институти 
20. Юридик техникумлар 
21. Конвенцион марказ мажмуаси дирексияси 
22. Интелектуал мулк департамент 
23. Интелектуал мулкни ҳуқуқий ҳимоя қилиш бошқармаси 
24. Интелектуал мулкни рўйхатга олиш ва ривожлантириш бошқармаси 
25. Халқароҳуқуқий ҳамкорлик ва халқаро рейтинглар бошқармаси 
26. Ўзбекистон манфаатларини ҳуқуқий ҳимоя қилиш бошқармаси 
27. Нотариат, адвокатура ва медиация бошқармаси 
28. Юридик хизматлар фаолиятини мувофиқлаштириш бошқармаси 
29. Нодавлат нотижорат ташкилотлар бошқармаси 
30. Интелектуал мулк маркази давлат муассасаси 
31. Давлат хизматлари департаменти 
32. Давлат хизматлари кўрсатилишини назорат қилиш бошқармаси 
33. Давлат хизматлари марказлари ва ФҲДЙ органлари фаолиятини мувофиқлаштириш бошқармаси 
34. Давлат хизматларини таҳлил қилиш ва ривожлантириш бошқармаси 
35. Рақамлаштириш бошқармаси 
36. Ўзархив агентлиги 
37. Персоналлаштириш агентлиги 
38. Адлия органлари ва муассасаларида ахбороткоммуникация технологияларини ривожлантириш маркази 
39. Стратегик режалаштириш ва ижро назорати бошқармаси 
40. Ахборот хизмати 
41. Инсон ресурслари бошқармаси 
42. Молия иқтисод бошқармаси 
43. Ишлар бошқармаси 
44. Адлия вазирлиги тузилмасида коррупцияга қарши курашиш бўлими 
45. Ички аудит бўлими 
46. Биринчи бўлим""",
        "tizimidagitashkilotlar": """🏢Адлия вазирлигининг тизимидаги ташкилотлар:
1. Вазирлик марказий аппарати 
2. Қорақалпоғистон Республикаси Адлия вазирлиги, вилоятлар ва Тошкент шаҳар адлия бошқармалари, туманлар 
(шаҳарлар) адлия бўлимлари, юридик хизмат кўрсатиш марказлари, давлат хизматлари марказлари ва ФҲДЁ 
органлари 
3. Ўзархив агентлиги, Қорақалпоғистон Республикаси, вилоятлар ва Тошкент шаҳар архив иши ҳудудий 
бошқармалари, Ўзбекистон Миллий архиви, Ўзбекистон Кинофотофоно ҳужжатлари миллий архиви, Ўзбекистон Илмийтехника ва тиббиёт ҳужжатлари миллий архиви, Қорақалпоғистон Республикаси марказий давлат архиви, 
Тошкент шаҳар марказий давлат архиви, вилоят, шаҳар ва туман давлат архивлари ҳамда уларнинг филиаллари 
4. Персоналлаштириш агентлиги
5. Х.Сулаймонова номидаги Республика суд экспертиза маркази 
6. Адолат миллий ҳуқуқий ахборот маркази давлат муассасаси
7. Адлия органлари ва муассасаларида ахбороткоммуникация технологияларини ривожлантириш маркази давлат муассасаси 
8. Интелектуал мулк маркази давлат муассасаси
9. давлат нотариал идоралари ва архивлари
10. Юридик кадрларни қайта тайёрлаш ва малакасини ошириш институти
11. Қонунчиликни таҳлил қилиш ва тартибга солиш таъсирини баҳолаш институти 
12. Тошкент давлат юридик университети ва унинг ҳузуридаги академик лицейлар
13. юридик техникумлар""",
        "hududiyboshqarmalar": """📍Адлия вазирлигининг ҳудудий бошқармалари:
🇺🇿 Қорақалпоғистон Республикаси Адлия вазирлиги 
Андижон вилоят адлия бошқармаси 
Бухоро вилоят адлия бошқармаси 
Жиззах вилоят адлия бошқармаси 
Қашқадарё вилоят адлия бошқармаси 
Навоий вилоят адлия бошқармаси 
Наманган вилоят адлия бошқармаси 
Самарқанд вилоят адлия бошқармаси 
Сурхондарё вилоят адлия бошқармаси 
Сирдарё вилоят адлия бошқармаси 
Фарғона вилоят адлия бошқармаси 
Тошкент вилоят адлия бошқармаси 
Хоразм вилоят адлия бошқармаси 
Тошкент шаҳар адлия бошқармаси""",
        "asosiyvazifalari": """📑Адлия вазирлигининг асосий вазифалари:
1. адлия органларини Одилона қонунларни қабул қилиш, жамиятда қонунга ҳурмат руҳини қарор топтириш демократик ҳуқуқий давлат қуришнинг гаровидир деган концептуал ғояни ҳаётга татбиқ этишга қаратилган ягона давлат ҳуқуқий сиёсати амалга оширилишини таъминлайдиган профессионал хизматга айлантириш 
2. адлия органлари фаолиятига, устувор равишда, танқидий таҳлил ва ҳуқуқий муаммоларни, аввало, бевосита 
жойларда ишларни самарали ташкил этиш йўли билан ҳал этишга асосланган, сифат жиҳатидан янги 
механизмларни жорий этиш 
3. давлат органлари ва ташкилотларининг туман (шаҳар) тузилмаларининг қонунлар ва бошқа норматив-ҳуқуқий ҳужжатлар ижросини ташкил этиш соҳасидаги фаолиятига услубий раҳбарлик қилиш ва мувофиқлаштириш, танқидий таҳлил асосида изчил ва бир хил ҳуқуқни қўллаш амалиётини таъминлаш бўйича чора-тадбирларни амалга ошириш
4. ҳуқуқий тарғибот ва фуқароларнинг ҳуқуқий онгини оширишнинг замонавий ва таъсирчан услубларини жорий қилиш, уларга қабул қилинаётган қонунлар ва бошқа норматив-ҳуқуқий ҳужжатлар мазмунмоҳияти ва аҳамиятини етказиш, аҳолининг ҳуқуқий саводсизлигига барҳам бериш бўйича чора-тадбирларни амалга ошириш
5. давлат бошқаруви тизимининг самарадорлигини, маъмурий тартиб-таомиллар ва давлат хизматларининг сифатини комплекс ва танқидий таҳлил қилишда адлия органларининг ролини ошириш, бу соҳаларда қонунчиликни янада такомиллаштириш ва ҳуқуқни қўллаш амалиёти бўйича таклифлар ишлаб чиқиш ўз фаолиятлари юзасидан жамоатчиликка тизимли равишда маълумотлар тақдим этиш йўли билан адлия органлари мансабдор шахсларининг ҳисобот бериш тартибини жорий этиш, уларнинг аҳолини ташвишга солувчи муаммоларга юзаки муносабатда бўлиши ҳолатларига чек қўйиш, шунингдек, уларнинг фаолиятини баҳолашнинг аниқ мезонларини белгилаш
6. юридик кадрларни, айниқса, талаб қилинаётган тор доирадаги ва соҳавий мутахассисликлар бўйича тайёрлаш, 
қайта тайёрлаш ва малакасини оширишнинг сифат жиҳатидан янги тизимини ташкил этиш, юриспруденция 
соҳасидаги мутахассисларни ўқитишнинг инновацион шакллари ва усулларини жорий этиш, юридик кадрларни 
етакчи хорижий таълим муассасаларига тизимли равишда юбориш 
7. халқаро ва хорижий ташкилотларда Ўзбекистон Республикасининг манфаатларини ҳуқуқий ҳимоя қилишнинг самарали тизимини, халқаро жамоатчилик ва хорижий инвесторларни мамлакатда амалга оширилаётган ҳуқуқий ислоҳотлар ҳақида хабардор қилиш механизмларини ташкил этиш адлия органлари ва муассасалари фаолиятининг моддий-техника таъминотини янада яхшилаш, ходимларни ижтимоий ва моддий рағбатлантиришнинг янги механизмларини, шу жумладан уларни хизмат уйлари билан таъминлашни жорий этиш
8. адлия органлари ва муассасаларининг барча тузилмалари фаолияти самарадорлигини оширишга йўналтирилган замонавий ахборот-коммуникация технологияларини кенг жорий этиш""",
        "hujjatlar": """📄Ҳужжатлар:

🇺🇿 Ўзбекистон Республикаси Адлия вазирлиги тўғрисидаги Низом — ПҚ-3666 (2018 йил 13 апрель)
https://lex.uz/docs/3681790#3685540

🇺🇿 Давлат ҳуқуқий сиёсатини амалга оширишда адлия органлари фаолиятини такомиллаштириш тўғрисидаги фармон — ПФ-5415 (2018 йил 13 апрель)
https://lex.uz/docs/3681777

🇺🇿 Жамиятда ҳуқуқий онг ва маданиятни юксалтириш ҳақидаги фармон — ПФ-5618 (2019 йил 9 январь)
https://lex.uz/docs/4149765

🇺🇿 Давлат ҳуқуқий сиёсатини амалга оширишда адлия органлари ва муассасалари фаолиятини янада 
такомиллаштириш чора-тадбирлари тўғрисида -  ПФ5997-сонли фармон (2020 йил 19май)
https://lex.uz/docs/4820060 

🇺🇿 Ўзбекистон республикаси адлия вазирлиги ҳузуридаги давлат хизматлари агентлиги фаолиятини ташкил этиш 
тўғрисида - ПҚ-3430-сонли қарор (2017 йил 12декабр)
https://lex.uz/docs/3454989 

🇺🇿 Ўзбекистон Республикаси адлия органлари ва муассасалари ходимларининг одоб-аҳлоқ қоидалари - Ўзбекистон Республикаси адлия вазирининг 252-УМ-сон буйруғига 1илова (2022 йил 28октабр)
https://sirdaryo.adliya.uz/uz/anticor_uz/anticor_docs/detail.php?ID=37735"""
    },

    "Инвестициялар, саноат ва савдо вазирлиги": {
        "tuzilmasi": """🧩Инвестициялар, саноат ва савдо вазирлиги тизими:

- Марказий аппарат

- Қорақалпоғистон Республикаси инвестициялар ва ташқи савдо вазирлиги

- Вилоятлар ва Тошкент шаҳар инвестициялар ва ташқи савдо бошқармалари 

- Туманлар (шаҳарлар) инвестициялар ва ташқи савдо бўлимлари 

- Хорижий инвестицияларни жалб этиш агентлиги

- Экспортни рағбатлантириш агентлиги

- Инвестиция лойиҳаларини ишлаб чиқиш маркази.

- Халқаро ҳамкорлик ва ривожланиш агентлиги

- Рақамли трансформация маркази.""",
        "tizimidagitashkilotlar": 
"""🏛 Инвестициялар, саноат ва савдо вазирлигининг тизимидаги ташкилотлар:

Инвестициялар, саноат ва савдо вазирлиги ҳузуридаги Хорижий инвестицияларни жалб этиш агентлиги""",
        
	"hududiyboshqarmalar": 
"""📍Инвестициялар, саноат ва савдо вазирлигининг ҳудудий бошқармалари:

Қорақалпоғистон Республикаси бошқармаси

Андижон вилояти бошқармаси

Бухоро вилояти бошқармаси

Жиззах вилояти бошқармаси

Қашқадарё вилояти бошқармаси

Навоий вилояти бошқармаси

Наманган вилояти бошқармаси

Самарқанд вилояти бошқармаси

Сурхондарё вилояти бошқармаси

Сирдарё вилояти бошқармаси

Фарғона вилояти бошқармаси

Тошкент вилояти бошқармаси

Хоразм вилояти бошқармаси

Тошкент шаҳар бошқармаси""",
        
	"asosiyvazifalari": """✍️Инвестициялар, саноат ва савдо вазирлигининг асосий вазифалари:

- ягона давлат инвестиция сиёсатини амалга ошириш, давлат ривожланиш дастурлари ва инвестиция дастурлари, шу жумладан тармоқ ва ҳудудий инвестиция дастурларининг ишлаб чиқилиши ва самарали амалга оширилишини мувофиқлаштириш

- хорижий инвестицияларни жалб қилиш ишларини мувофиқлаштириш, халқаро иқтисодий ва молия институтлари, хорижий ҳукумат молия ташкилотлари билан икки томонлама ва кўп томонлама форматда ўзаро самарали ҳамкорликни амалга ошириш

- давлат органлари ва ташкилотларининг фаолияти, Ўзбекистон Республикасининг халқаро ҳамда хорижий молия ва иқтисодий институтлардаги доимий вакиллари, шунингдек, Ўзбекистон Республикаси Ташқи ишлар вазирлиги билан биргаликда Ўзбекистон Республикасининг хорижий муассасаларида ташқи иқтисодий фаолият масалалари билан шуғулланувчи ходимлар фаолиятини мувофиқлаштириш

- давлат органлари ва ташкилотларининг республикага ташқи беғараз кўмак (грантлар, техник кўмак, мақсадли беғараз ёрдам) маблағларини жалб қилиш бўйича фаолиятини мувофиқлаштириш, шунингдек, уларнинг мақсадли фойдаланилишини ҳисобга олиш ва мониторинг қилиш

- Ўзбекистон Республикасининг савдо-иқтисодий ва инвестициявий ҳамкорлик масалалари бўйича халқаро шартномаларини тайёрлаш, келишиш ва имзолашда иштирок этиш

- инвесторлар билан доимий қайта алоқани йўлга қўйиш, инвестицияларни жалб қилишда ҳудудлар ва маҳаллий компанияларга кўмаклашиш, инвестиция таклифларини ишлаб чиқишни ташкил этиш

- ташқи савдо соҳасида ягона давлат сиёсатини амалга ошириш, Экспортни қўллаб-қувватлаш миллий тизимининг самарали ишлашига кўмаклашиш ва таъминлаш, ташқи савдо фаолиятини тартибга солиш соҳасида давлат органлари ва ташкилотларининг фаолиятини мувофиқлаштириш

- савдода тариф ва нотариф тартибга солиш чораларини қўллаш ҳамда электрон тижорат тартиб-таомилларини такомиллаштириш билан боғлиқ тадбирларни мувофиқлаштириш

- Ўзбекистон Республикасининг хорижий давлатлар билан савдо-иқтисодий ва инвестициявий алоқаларини кенгайтириш ва мустаҳкамлаш, товарлар, ишлар ва хизматлар экспортини қўллаб-қувватлаш

- Ўзбекистон Республикасининг Жаҳон савдо ташкилотига аъзо бўлиш ва у билан ҳамда бошқа кўп томонлама иқтисодий ташкилотлар билан ҳамкорлик қилиш жараёнларини мувофиқлаштириш

- улгуржи ва биржа ташқи савдони тартибга солиш масалаларини мувофиқлаштириш, халқаро бозорлар ҳолатини мониторинг ва таҳлил қилиш, маркетинг тадқиқотларини ўтказиш ва товарларнинг жаҳондаги нархлари тўғрисидаги маълумотларни таҳлил қилиш

- ташқи савдо инфратузилмасини ривожлантириш, шу жумладан транзит салоҳияти даражасини ошириш, логистика ва транспорт йўлакларини такомиллаштириш, шунингдек, экспорт маршрутларини диверсификация қилиш масалаларини илгари суриш

- маҳаллий саноатни жадал ривожлантиришни таъминлаш.""",
        "hujjatlar": """📚Инвестициялар, саноат ва савдо вазирлигининг фаолиятига доир асосий ҳужжатлар:

Ўзбекистон Республикаси Инвестициялар ва ташқи савдо вазирлиги тўғрисида НИЗОМ – ВМҚ-390-сон (2019 йил 10 май)
http://lex.uz/docs/4327455

Ўзбекистон Республикаси Инвестициялар ва ташқи савдо вазирлиги фаолиятини ташкил этиш тўғрисида – ПҚ-4135-сон (2019 йил 28 январь)
https://lex.uz/docs/4182334

Ўзбекистон Республикасининг Ташқи иқтисодий фаолияти тўғрисида – ЎРҚ-77-II-сон (2000 йил 26 май)
https://lex.uz/docs/67345

Ўзбекистон Республикасининг Ташқи иқтисодий фаолиятини янада тартибга солиш ҳамда божхона-таъриф жиҳатдан тартибга солиш тизимини такомиллаштириш чора-тадбирлари тўғрисида – ПҚ-3818-сон (2018 йил 29 июнь)
https://lex.uz/docs/3802363"""
    },
    "Иқтисодиёт ва молия вазирлиги": {
        "tuzilmasi": """Иқтисодиёт ва молия вазирлиги тизими:

- Вазирликнинг марказий аппарати

- Қорақалпоғистон Республикаси Иқтисодиёт ва молия вазирлиги, вилоятлар ва Тошкент шаҳар иқтисодиёт ва молия бош бошқармалари

- Туман ва шаҳарлар иқтисодиёт ва молия бўлимлари

- Божхона қўмитаси

- Ғазначилик хизмати қўмитаси

- Давлат захираларини бошқариш қўмитаси

- Кадастр агентлиги

- Давлат асиллик даражаси назорати инспекцияси""",
        "tizimidagitashkilotlar": """🏢 Иқтисодиёт ва молия вазирлигининг тизимидаги ташкилотлар:

- Бюджетдан ташқари пенсия жамғармаси

- Ахборот технологиялари маркази ДУК

- Бюджет-солиқ илмий тадқиқотлари институти

- Молия органлари ҳамда бюджет ташкилотлари молия-ҳисоб бўлинмалари ходимларини тайёрлаш ва қайта тайёрлаш ўқув маркази

- Тармоқ бозорлари ва ишлаб чиқаришда меҳнат унумдорлиги тадқиқотлари маркази

- Қишлоқ хўжалигини давлат томонидан қўллаб-қувватлаш жамғармасини бошқариш департаменти

- Саноат корхоналарининг энергия самарадорлигини ошириш лойиҳаси

- Яшил иқтисодиёт лойиҳалари маркази лойиҳа офиси

- Қишлоқ инфратузилмасини ривожлантириш ва қишлоқ жойларни барқарор ривожлантириш бирлаштирилган лойиҳаларни амалга ошириш гуруҳи ДМ

- Инфратузилма лойиҳаларини амалга ошириш дирекцияси ДМ

- Саноат сиёсатини амалга ошириш ва саноатнинг базавий тармоқларини ривожлантириш йўналишларини ишлаб чиқиш лойиҳа офиси

- Ўзбекистонда давлат-хусусий шериклик лойиҳаларини ишлаб чиқиш жамғармаси

- Маъмурий бинолардан фойдаланиш бошқармаси

- Институционал салоҳиятни ошириш лойиҳасини амалга ошириш гуруҳи

- Ўрта шаҳарларни комплекс ривожлантириш лойиҳаси

- UzAssets Инвестиция Компанияси АЖ

- Тадбиркорликни ривожлантириш компанияси АЖ

- Лойиҳалар ва импорт контрактларини комплекс экспертиза қилиш маркази ДУК""",
        "hududiyboshqarmalar": """📍Иқтисодиёт ва молия вазирлигининг ҳудудий бошқармалари:

Қорақалпоғистон Республикаси бошқармаси

Андижон вилояти бошқармаси

Бухоро вилояти бошқармаси

Жиззах вилояти бошқармаси

Қашқадарё вилояти бошқармаси

Навоий вилояти бошқармаси

Наманган вилояти бошқармаси

Самарқанд вилояти бошқармаси

Сурхондарё вилояти бошқармаси

Сирдарё вилояти бошқармаси

Фарғона вилояти бошқармаси

Тошкент вилояти бошқармаси

Хоразм вилояти бошқармаси

Тошкент шаҳар бошқармаси""",
        "asosiyvazifalari": """📈 Иқтисодиёт ва молия вазирлигининг асосий вазифалари:

1. барқарор иқтисодий ўсишни стратегик режалаштириш (таъминлаш)

2. макроиқтисодий сиёсатни ишлаб чиқиш, мувофиқлаштириш ва юритиш

3. инфляцияни жиловлаш, ички истеъмол бозорини ривожлантириш, озиқ-овқат хавфсизлиги ва нархлар барқарорлигини таъминлаш бўйича таклифларни шакллантириш

4. ҳудудларни комплекс ижтимоий-иқтисодий ривожлантириш бўйича чора-тадбирларни мувофиқлаштириб бориш

5. барқарор ривожланишнинг миллий мақсадларига эришиш ва инсон капиталини ривожлантириш

6. ижтимоий ва ишлаб чиқариш инфратузилмасини ривожлантириш дастурини шакллантириш, амалга ошириш ва молиялаштириш

7. урбанизация сиёсатини юритиш

8. аҳолини уй-жой билан таъминлаш, ипотека бозорини молиялаштириш ва ривожлантириш

9. хизматлар ва сервис соҳасини ривожлантириш

10. ҳудудларнинг мастер-режаларини ишлаб чиқиш ва амалга оширишни мувофиқлаштириш

11. яшил иқтисодиётга ўтиш стратегияси ҳамда иқтисодий ўсишни яшил тамойиллар асосида амалга оширилишини таъминлаш, бу борада давлат сиёсатини мувофиқлаштирувчи орган вазифасини бажариш

12. солиқ ва божхона сиёсатини мувофиқлаштириш

13. бюджет сиёсати ва бюджетлараро муносабатлар соҳасини такомиллаштириш

14. давлат бюджети ижросини таъминлаш давлат қарзини ва фискал хатарларни бошқариш

15. иқтисодиёт тармоқларининг нархланиши ва молиявий мутаносиблигини таъминлаш

16. бухгалтерия ҳисоби, молиявий ҳисобот ва аудиторлик фаолиятини тартибга солиш ва уларни методологиясини шакллантириш

17. саноат сиёсатини юритиш, базавий тармоқларда таркибий ислоҳотларни амалга ошириш

18. давлат молиясини бошқариш стратегик аҳамиятга эга давлат иштирокидаги корхоналарни ва тижорат банкларини трансформация қилиш ва хусусийлаштириш жараёнларини самарали ташкил этиш

19. давлат-хусусий шерикликни ривожлантириш кичик ва ўрта бизнесни ривожлантириш ҳамда яхлит тадбиркорлик экотизимини жорий этиш

20. давлат харидлари сиёсатини юритиш

21. рақамлаштириш сиёсатини амалга ошириш

22. хорижий давлатлар билан икки томонлама иқтисодий ва молиявий алоқаларни ривожлантириш

23. давлат органларининг ички аудит тузилмалари фаолиятини ривожлантириш ва мувофиқлаштириш""",
        "hujjatlar": """📄 Иқтисодиёт ва молия вазирлигининг фаолиятига доир асосий ҳужжатлар:

Ўзбекистон Республикаси Иқтисодиёт ва молия вазирлиги тўғрисида ВАҚТИНЧАЛИК НИЗОМ – Иқтисодиёт ва молия вазирининг 2024 йил 9-апрелдаги 23-70-сонли буйруғига 2-илова
https://www.imv.uz/oz/static/vazirlikning-vazifalari-va-funksiyalari-2

Ўзбекистон Республикаси Иқтисодиёт ва молия вазирлиги ҳузуридаги Қишлоқ хўжалигини давлат томонидан қўллаб-қувватлаш жамғармаси тўғрисида НИЗОМ – ВМҚ-533-сон (2018 йил 12 июль) 
https://lex.uz/ru/docs/3823434

Ўзбекистон Республикаси Иқтисодиёт ва молия вазирлигининг маблағлари ҳисобидан ипотека кредитлари ажратиш тартиби тўғрисида НИЗОМ – ВМҚ-56-сон (2021 йил 5 февраль)
https://lex.uz/uz/docs/5266510

Ўзбекистон Республикаси Иқтисодиёт ва молия вазирлиги ҳузуридаги Божхона қўмитаси тўғрисидаги НИЗОМ – ПҚ-122-сон (2025 йил 25 март)
https://lex.uz/docs/7452043"""
    },
    "Тоғ-кон саноати ва геология вазирлиги": {
        "tuzilmasi": """Тоғ-кон саноати ва геология вазирлиги тизими:

- Ўзбекгидрогеология ДМ

- Ер қаъридан фойдаланиш маркази ДМ

- Тоғ-кон саноати ва геология соҳасини назорат қилиш инспекцияси

- Навоийуран ДК

- Ўзбек геология қидирув АЖ

- Геология фанлари университети ДМ

- Навоий давлат кончилик ва технологиялар университети ДМ

- Геология, кон-металлургия ва мисни қайта ишлаш саноатини ривожлантириш лойиҳа офиси ДМ

- Ўзбекгеофизика АЖ

- Минерал ресурслар институти ДМ

- Геология ва геофизика институти ДМ

- Гидрогеология ва муҳандислик геологияси институти ДМ

- Нефть ва газ конлари геологияси ва қидируви институти ДМ

- Тоғ-кон ва геология соҳаси ходимлари малакасини ошириш институти ДМ

- Геология музейи ДМ

- Китоб геология табиат миллий боғи ДМ

- Федерал давлат автоном олий таълим муассасаси Миллий тадқиқот технологик университети МИСиСнинг Олмалиқ шаҳридаги филиали

- Навоий КМК АЖ

- Олмалиқ КМК АЖ

- Ўзбеккўмир АЖ

- Ўзметкомбинат АЖ

- Шарғункўмир АЖ

- Тошкент металлургия заводи МЧЖ ҚК""",
        "tizimidagitashkilotlar": """Тоғ-кон саноати ва геология вазирлигининг тизимидаги ташкилотлар:

Ўзбекгеофизика АЖ

Навоий кон-металлургия комбинати АЖ

Ўзбек геология қидирув АЖ

Геология фанлари университети ДМ

Ер қаъридан фойдаланиш маркази ДМ

Навоий давлат кончилик ва технологиялар университети ДМ

Ўзбекгидрогеология ДМ

Олмалиқ кон-металлургия комбинати АЖ

Ўзметкомбинат АЖ

Шарғункўмир АЖ

Ўзбеккўмир АЖ

Тошкент металлургия заводи МЧЖ ҚК

Навоийуран ДК

Федерал давлат автоном олий таълим муассасаси Миллий тадқиқот технологик университети МИСиСнинг Олмалиқ шаҳридаги филиали

Тоғ-кон саноати ва геология соҳасини назорат қилиш инспекцияси

Ўзбекистон технологик металлар комбинати АЖ""",
        "asosiyvazifalari": """Тоғ-кон саноати ва геология вазирлигининг асосий вазифалари:

1. тоғ-кон саноати ва геология соҳасида ягона давлат сиёсатини ишлаб чиқиш ва амалга ошириш ҳамда мазкур йўналишларда ижро этувчи ҳокимият органларининг фаолиятини мувофиқлаштириш

2. геология-қидирув ишларини амалга ошириш орқали республиканинг минерал-хомашё базасини барқарор ривожлантириш, инвестицияларни жалб қилиш ва фойдали қазилмаларнинг янги конларини аниқлаш, саноат тармоқларининг минерал-хомашё базасини диверсификация қилиш ишларини ташкил этиш

3. республикада фойдали қазилмалар истиқболли майдонларини аниқлаш учун илмий-тадқиқот, минтақавий геологик тасвирлаш, геофизик ва бурғилаш ишларини амалга ошириш ҳамда фойдали қазилмалар захираларини кўпайтиришда геология-қидирув ишларининг самарадорлигини ошириш

4. республикада ер ости сувларидан фойдаланиш ва қудуқ бурғилаш тизимини янада такомиллаштириш, аҳоли орасида ер ости сувларидан фойдаланиш маданиятини кенг тарғиб қилиш, уларнинг миқдор жиҳатидан камайиб кетиши ва ифлосланишининг олдини олиш ишларини тизимли йўлга қўйиш

5. қаъридан фойдаланиш ва саноат хавфсизлигини таъминлаш масалаларида шаффоф тизим асосида ўз вақтида ва сифатли давлат хизматларини кўрсатиш, қимматбаҳо металларни олтин изловчилар усулида қазиб олиш фаолиятини такомиллаштириш ҳамда ер қаърининг давлат фондини юритиш, маълумотлар очиқлигини таъминлаш

6. тоғ-кон, геология ва саноат хавфсизлигини назорат қилишда қонунчиликка риоя этилишини таъминлаш, соҳадаги ҳуқуқбузарликларнинг олдини олиш ҳамда давлат ва жамоатчилик назоратини кучайтириш ишларини ташкиллаштириш

7. қимматбаҳо, рангли, қора ва ноёб металлар, уран, кўмир ва углеводород қазиб олиш ҳамда қайта ишлаш соҳасини лойиҳа ва инжиниринг хизматлари, илмий-тадқиқот ва тажриба-конструкторлик ишларининг ўзаро боғлиқлигини таъминлаган ҳолда кластер усулида ривожлантириш

8. соҳада таълим, илм-фан ва амалиёт интеграцияси асосида замонавий фикрлайдиган ва юқори малакали мутахассисларни тайёрлаш, уларнинг малакасини доимий ошириб бориш тизимини яратиш ҳамда халқаро ҳамкорлик алоқаларини ўрнатиш ҳисобига технологик тажриба ва билим алмашувини йўлга қўйиш

9. йирик ишлаб чиқариш қувватларини ишга тушириш, улардаги жараёнларни кенг рақамлаштириш ва илғор дастурий таъминотлардан фойдаланган ҳолда, зарур энергия ресурслари ва муҳандислик тармоқлари билан уйғунликда ҳудудий инфратузилма дастурлари билан узвий боғлаш

10. тармоқлараро кооперация алоқаларини ривожлантириш орқали соҳада импорт ўрнини босувчи, экспортбоп маҳсулотлар ишлаб чиқаришни маҳаллийлаштириш даражасини ошириш

11. соҳага хорижий ва маҳаллий инвестицияларни кенг жалб қилиш учун тадбиркорлик субъектларига қулай шарт-шароитлар яратиш ва уларни рағбатлантириш механизмларини янада такомиллаштириш бўйича қонунчилик ҳужжатларини тайёрлаш

12. вазирлик тизимидаги ҳамда тоғ-кон саноати, геология ва металлургия соҳаси ташкилотлари фаолиятида киберхавфсизликка таҳдидларни аниқлаш, уларнинг олдини олиш ҳамда уларга қарши таъсирчан чоралар кўриш бўйича тадбирларни мувофиқлаштириш""",
        "hujjatlar": """📄Тоғ-кон саноати ва геология вазирлигининг фаолиятига доир асосий ҳужжатлар:

Ўзбекистон Республикаси Президентининг 2023 йил 27 июлдаги ПФ-116-сон Фармонига 1-ИЛОВА
https://lex.uz/docs/6937310

Геология-қидирув ишларида хавфсизлик Қоидалари – 29.01.1997 йилда рўйхатдан ўтган, рўйхат рақами 304
https://lex.uz/docs/1100925

Тоғ-кон саноати ва геология соҳасидаги айрим географик объектларнинг номларини давлат тили қоида ва меъёрларига мувофиқлаштириш ҳамда янги ном бериш тўғрисида – ВМҚ 379-сон (2025 йил 18 июнь) 
https://lex.uz/docs/7580351

Ўзбекистон Республикаси Тоғ-кон саноати ва геология вазирлиги ҳузуридаги Тоғ-кон саноати ва геология соҳасини назорат қилиш инспекцияси фаолиятини ташкил этиш чора-тадбирлари тўғрисида – ВМҚ 131-сон (2025 йил 28 февраль) 
https://lex.uz/docs/7409820

Ер қаъри тўғрисида – ЎРҚ-987-сон (2024 йил 31 октабрь)
https://lex.uz/docs/7182161

 Қимматбаҳо металлар ва қимматбаҳо тошлар тўғрисида – ЎРҚ-710-сон (2021 йил 23 августь)
https://lex.uz/ru/docs/5595448

Ўзбекистон Республикасида хизмат кўрсатган геолог фахрий унвонини таъсис этиш тўғрисида – ЎРҚ-650-сон (2020 йил 30 ноябрь)  
https://lex.uz/docs/5132624

Ер ости бойликлари тўғрисида – ЎРҚ-2018-ХИИ-сон (23.09.1994 йил)
https://lex.uz/ru/docs/75847

Ер ости сув ресурсларини муҳофаза қилиш ва улардан оқилона фойдаланишни тартибга солиш бўйича қўшимча чора-тадбирлар тўғрисида –  ПҚ-439-сон (2022 йил 07 декабрь)
https://lex.uz/ru/docs/6311240

Ўзбекистон Республикаси Давлат геология ва минерал ресурслар қўмитаси тизимидаги Геология фанлари университети фаолиятини янада такомиллаштириш чора-тадбирлари тўғрисида – ПҚ-154-сон  (2022 йил 02 март) 
https://www.lex.uz/docs/5896299

Нефть ва газ геология-қидирув ишларини ташкил этиш ва олиб бориш тизимини такомиллаштириш чора-тадбирлари тўғрисида –ПҚ-4522-сон (2019 йил 18 ноябрь)
https://lex.uz/docs/4600379

Ўзбекистон Республикаси давлат Геология ва минерал ресурслар қўмитаси фаолиятини тубдан такомиллаштириш чора-тадбирлари тўғрисида – ПҚ-3578-сон (2018 йил 01 март) 
https://lex.uz/docs/3574423

Геология-қидирув ишлари қийматини жорий нархларда ҳисоб-китоб қилиш тартиби тўғрисида йўриқномани тасдиқлаш ҳақида – Давлат геология ва минерал ресурслар қўмитасининг қарори, 23.10.2012 йилда рўйхатдан ўтган, рўйхат рақами 2395
https://lex.uz/ru/docs/2072433"""
    },
    "Қурилиш ва уй-жой коммунал хўжалиги вазирлиги": {
        "tuzilmasi": """Қурилиш ва уй-жой коммунал хўжалиги вазирлиги тизими:

- марказий аппарат

- Қорақалпоғистон Республикаси Қурилиш ва уй-жой коммунал хўжалиги вазирлиги, вилоятлар Қурилиш ва уй-жой коммунал хўжалиги бош бошқармалари, Тошкент шаҳар Қурилиш бош бошқармаси ва Тошкент шаҳар Уй-жой коммунал хўжалиги бош бошқармаси (кейинги ўринларда — Бош бошқарма)

- туман (шаҳар) қурилиш ва уй-жой коммунал хўжалиги бўлимлари, Тошкент шаҳрида — туман қурилиш бўлимлари ва уй-жой коммунал хўжалиги бўлимлари

- шаҳарсозлик ҳужжатларини экспертиза қилиш Республика маркази давлат муассасаси ва унинг ҳудудий бошқармалари

- ахборот-коммуникация технологияларини ривожлантириш Республика маркази давлат муассасаси

- урбанизация ва шаҳарсозлик ҳужжатларини ишлаб чиқиш Республика маркази давлат муассасаси

- компетенцияни ривожлантириш институти давлат муассасаси (Архитекторлар муҳандислар олий мактаби, Қайта тайёрлаш ва малака ошириш маркази, Малакани баҳолаш маркази, ҳудудий филиаллар)

- техник меъёрлаш ва стандартлаштириш илмий-тадқиқот институти давлат муассасаси

- Ўзбекистон бунёдкори Нашриёт уйи МЧЖ

- Ўзбекистон архитектураси ва қурилиши журнали таҳририяти МЧЖ

- Қорақалпоғистон Республикаси, вилоятлар ва Тошкент шаҳри Қурилиш соҳасида давлат харидларини ташкил этиш консалтинг марказлари давлат муассасалари

- иссиқлик таъминоти объектлари бўйича инжиниринг компаниялари

- иссиқлик таъминоти давлат ташкилотлари

- коммунал таъминот маркази давлат муассасаси

- ТошуйжойЛИТИ АЖ

- Ўзоғирсаноатлойиҳа АЖ

- ЎзшаҳарсозликЛИТИ бош лойиҳа институти давлат муассасаси

- ТошкентбошпланЛИТИ бош лойиҳа институти давлат муассасаси

- қишлоқ қурилиш лойиҳа бош лойиҳа институти давлат муассасаси

- коммунал лойиҳа илмий-тадқиқот институти давлат муассасаси

- лойиҳа офиси

- инфратузилмани ривожлантириш инжиниринг компанияси давлат муассасаси.""",
        "tizimidagitashkilotlar": """Қурилиш ва уй-жой коммунал хўжалиги вазирлигининг тизимидаги ташкилотлар:

- Шаҳарсозлик ҳужжатларини экспертиза қилиш республика маркази

- Техник меъёрлаш ва стандартлаштириш илмий тадқиқот институти

- Ахборот-коммуникация технологияларини ривожлантириш Республика маркази

- Коммунал таъминот маркази

- Компетенсияни ривожлантириш институти

- ЎзшаҳарсозликЛИТИ бош лойиҳа институти ДУК

- Қишлоққурилишлойиҳа бош лойиҳа институти

- Коммунал лойиҳа илмий-тадқиқот институти

- ТошкентбошпланЛИТИ бош лойиҳа институти""",
        "hududiyboshqarmalar": """📍Қурилиш ва уй-жой коммунал хўжалиги вазирлигининг ҳудудий бошқармалари:

Тошкeнт шаҳар қурилиш ва уй-жой коммунал хўжалиги бош бошқармаси

Қорақалпоғистон Республикаси қурилиш ва уй-жой коммунал хўжалиги вазирлиги

Андижон вилояти қурилиш ва уй-жой коммунал хўжалиги бош бошқармаси

Бухоро вилояти қурилиш ва уй-жой коммунал хўжалиги бош бошқармаси

Жиззах вилояти қурилиш ва уй-жой коммунал хўжалиги бош бошқармаси

Қашқадарё вилояти қурилиш ва уй-жой коммунал хўжалиги бош бошқармаси

Навоий вилояти қурилиш ва уй-жой коммунал хўжалиги бош бошқармаси

Наманган вилояти қурилиш ва уй-жой коммунал хўжалиги бош бошқармаси

Самарқанд вилояти қурилиш ва уй-жой коммунал хўжалиги бош бошқармаси

Сирдарё вилояти қурилиш ва уй-жой коммунал хўжалиги бош бошқармаси

Сурхондарё вилояти қурилиш ва уй-жой коммунал хўжалиги бош бошқармаси

Фарғона вилояти қурилиш ва уй-жой коммунал хўжалиги бош бошқармаси

Тошкeнт вилояти қурилиш ва уй-жой коммунал хўжалиги бош бошқармаси

Хоразм вилояти қурилиш ва уй-жой коммунал хўжалиги бош бошқармаси""",
        "asosiyvazifalari": """Қурилиш ва уй-жой коммунал хўжалиги вазирлигининг асосий вазифалари:

1. шаҳарсозлик фаолияти соҳасида ягона давлат сиёсатини амалга ошириш, соҳада давлат сиёсатининг асосий йўналишлари бўйича таклифлар тайёрлаш, шунингдек, соҳа фаолиятини ривожлантиришнинг узоқ ва ўрта муддатли дастурларни ва норматив-ҳуқуқий ҳужжатларини ишлаб чиқишда, ҳудудларни ижтимоий-иқтисодий ривожлантириш дастурларини тайёрлашда иштирок этиш

2. норматив-ҳуқуқий ҳужжатлар, шаҳарсозлик нормалари ва қоидалари ҳамда стандартларни ишлаб чиқишни ташкил этиш ҳамда тасдиқлашни амалга ошириш

3. шаҳарсозлик фаолиятининг барча босқичлари рақамлаштирилишини таъминлаш, юридик ва жисмоний шахсларга кўрсатиладиган қурилиш ва уй-жой коммунал хўжалиги соҳасида давлат хизматларини соддалаштириш ва такомиллаштириб бориш

4. республика ҳудудини ривожлантиришни режалаштириш бош схемасини, Қорақалпоғистон Республикаси ва вилоятлар ҳудудларини ривожлантиришни режалаштириш схемаларини, агломерацияларни ривожлантириш стратегияси, шаҳарлар (шаҳарчалар) бош режалари ва қишлоқ аҳоли пунктларининг ҳудудларини шаҳарсозлик жиҳатидан ривожлантириш схемаларини ишлаб чиқиш ва тасдиқлашни ташкил қилиш, шунингдек, уларга риоя этилиши юзасидан давлат архитектура назоратини амалга ошириш

5. лойиҳа ташкилотлари фаолиятини мувофиқлаштириш ва мониторингини юритиш, якка тартибдаги, намунавий, такроран қўлланиладиган экспериментал лойиҳаларни ва энергия тежамкор лойиҳа ечимлари ишлаб чиқишни ташкил этиш, улар фаолиятини лицензиялаш ҳамда шаҳарсозлик ҳужжатларининг экспертиза қилинишини таъминлаш

6. мақсадли дастурларга киритилган объектларни мониторинг қилиш, лойиҳа ва қурилиш-пудрат ташкилотлари фаолиятида Шаффоф қурилиш миллий ахборот тизимида давлат харидлари ҳамда рейтинг тизимини юритиш

7. объектлар қурилиши жараёнида муаллифлик, техник ва ички назорат олиб борилиши устидан давлат назорати ўрнатилишини таъминлаш, шунингдек, республика ҳудудида қурилаётган бино ва иншоотларнинг сейсмик хавфсизлиги таъминланишини шаҳарсозлик нормалари ва қоидаларига мувофиқлиги баҳоланишини таъминлаш

8. уй-жой коммунал хўжалиги соҳасида ягона давлат сиёсатини юритиш ва тармоқлараро мувофиқлаштиришни амалга ошириш

9. кўп квартирали уйларни бошқариш, шу жумладан, кўп квартирали уй-жой фондини мукаммал ва жорий таъмирлаш ишларини, эски ва авария ҳолатидаги уй-жойлар бузилишини ташкил этишни мувофиқлаштириш ҳамда реновация дастурларини шакллантириш

10. ҳудудларни ободонлаштириш соҳаси муаммоларини ўрганиш ва методологик таъминлаш

11. ичимлик суви таъминоти ва оқова сувларни чиқариб юбориш соҳасида ягона давлат сиёсатини амалга ошириш, ривожлантириш, давлат назоратини таъминлаш, соҳада хизмат кўрсатувчилар фаолиятини мувофиқлаштириш

12. иссиқлик таъминоти соҳасини комплекс ривожлантириш, ягона техник ва тариф сиёсатини юритиш

13. уй-жой коммунал хўжалиги соҳасида (уй-жой фонди, ичимлик суви таъминоти ва оқова сувни чиқариш хизматлари ҳамда иссиқлик таъминоти) давлат бюджети, халқаро молия институтлари, хорижий ҳукумат молия ташкилотларининг маблағлари ҳамда давлат-хусусий шериклик ҳисобидан инвестиция лойиҳаларини амалга ошириш

14. қурилиш ва уй-жой коммунал хўжалиги соҳасида кадрларни маҳаллий ва хорижий етакчи таълим муассасаларида тайёрлаш, қайта тайёрлаш, малакасини ошириш ва компетенциясини баҳолаш ишларини ташкил этиш ҳамда сертификатлаш жараёнларини мувофиқлаштириш""",
        "hujjatlar": """📄 Қурилиш ва уй-жой коммунал хўжалиги вазирлигининг фаолиятига доир асосий ҳужжатлар:

Ўзбекистон Республикаси Қурилиш ва уй-жой коммунал хўжалиги вазирлиги тўғрисидаги НИЗОМ – ВМҚ 214-сон (2024 йил 17 апрель) 
https://lex.uz/uz/docs/6887886

Ичимлик суви таъминоти ва оқова сувларни чиқариб юбориш тўғрисида – ЎРҚ-784-сон (2022 йил 22 июль) 
https://lex.uz/ru/docs/6126864

Сув ва сувдан фойдаланиш тўғрисида НИЗОМ – ВМҚ 82-сон (2013 йил 19 март) 
https://lex.uz/docs/2145601

Кўп квартирали уйларни бошқариш тўғрисида – ЎРҚ-581-сон (2019 йил 07 ноябрь)
https://lex.uz/docs/4586282
Капитал қурилишда лойиҳа ва қурилиш ишларини амалга ошириш тартибини оптималлаштириш бўйича қўшимча чора-тадбирлар тўғрисида – ПФ-5445-сон (2018 йил 22 май) 
https://lex.uz/docs/3742487

«Обод маҳалла» дастури тўғрисида – ПФ-5467-сон (2018 йил 27 июнь)
https://lex.uz/docs/3797772

Ўзбекистон Республикаси Қурилиш ва уй-жой коммунал хўжалиги вазирлиги фаолиятини ташкил этиш тўғрисида – ПФ-66-сон (2025 йил 14 апрель) 
https://www.lex.uz/docs/7478539

«Обод қишлоқ» дастури тўғрисида – ПҚ-172-сон (2022 йил 18 март) 
https://lex.uz/docs/5914975

Сув таъминоти ва сув чиқариш хизмати кўрсатиш соҳасида тўлов интизомини тубдан такомиллаштириш чора-тадбирлари тўғрисида – ПФ-5241-сон (2017 йил 16 ноябрь) 
https://lex.uz/docs/3413656

Қурилиш соҳасига оид ягона маъмурий қурилиш регламентларини тасдиқлаш тўғрисида – ВМҚ 200-сон (2022 йил 20 апрель) 
https://lex.uz/docs/5970701

Лойиҳа-тадқиқот ишларининг қийматини аниқлаш тартиби тўғрисидаги НИЗОМ –  Қурилиш вазирининг буйруғи, 09.09.2019 йилда рўйхатдан ўтган, рўйхат рақами 3180
https://lex.uz/uz/docs/4504323

Оммавий тадбирлар ўтказиладиган объектларда ёнғин хавфсизлигига, тез тиббий ёрдам кўрсатишга, эвакуасияга ва ҳимоялаш бўйича муҳандислик-техник воситалар билан жиҳозлашга қўйиладиган ягона талаблар ҳамда уларга риоя этилиши устидан назоратни таъминлаш тартиби тўғрисидаги НИЗОМ – Ички ишлар вазирлиги, Фавқулодда вазиятлар вазирлиги, Соғлиқни сақлаш вазирлиги, Давлат архитектура ва қурилиш қўмитасининг қарори, 23.06.2014 йилда рўйхатдан ўтган, рўйхат рақами 2596
https://lex.uz/ru/docs/2415480"""
    },
	"Камбағалликни қисқартириш ва бандлик вазирлиги": {
        "tuzilmasi": """Камбағалликни қисқартириш ва бандлик вазирлиги вазирлиги тизими:

- Марказий аппарати

- Қорақалпоғистон Республикаси Камбағалликни қисқартириш ва бандлик вазирлиги, вилоятлар ва Тошкент шаҳри камбағалликни қисқартириш ва бандлик бошқармалари

- Туман (шаҳар) камбағалликни қисқартириш ва бандликка кўмаклашиш бўлимлари

- Ҳоким ёрдамчилари

- Камбағалликни қисқартириш ва бандлик вазирлиги ходимларининг малакасини ошириш маркази

- Касбий кўникмалар марказлари

- Камбағаллик ва меҳнат бозори тадқиқотлари институти

- Миллий техник малакани баҳолаш ва малака ошириш маркази

- Ягона миллий меҳнат тизими идоралараро дастурий-аппарат комплексини бошқариш дирекцияси

- Бандликка кўмаклашиш давлат жамғармаси

- Ҳоким ёрдамчилари фаолиятини қўллаб-қувватлаш жамғармаси

- Камбағаллик ва меҳнат соҳасидаги лойиҳаларни бошқариш маркази МЧЖ

- Тошкент шаҳридаги ходимларни бошқариш ва меҳнатни муҳофаза қилиш коллежи

- Янги иш ўринлари ташкил этишни рағбатлантириш ҳудудий жамғармалари""",
        "tizimidagitashkilotlar": """Камбағалликни қисқартириш ва бандлик вазирлигининг тизимидаги ташкилотлар:

1. Камбағалликни қисқартириш ва бандлик вазирлиги ходимларининг малакасини ошириш маркази

2. Камбағаллик ва меҳнат бозори тадқиқотлари институти

3. Камбағаллик ва меҳнат соҳасида лойиҳаларни бошқариш маркази МЧЖ

4. Тошкент шаҳридаги ходимларни бошқариш ва меҳнатни муҳофаза қилиш коллежи

5. Республика Касбий кўникмалар маркази

6. Миллий техник малакани баҳолаш ва малака ошириш маркази

7. Ягона миллий меҳнат тизими идоралараро дастурий-аппарат комплексини бошқариш дирекцияси МЧЖ""",
        "hududiyboshqarmalar": """📍 Камбағалликни қисқартириш ва бандлик вазирлигининг ҳудудий бошқармалари:

Қорақалпоғистон Республикаси ҳудудий бошқармаси

Андижон вилояти ҳудудий бошқармаси

Бухоро вилояти ҳудудий бошқармаси

Жиззах вилояти ҳудудий бошқармаси

Қашқадарё вилояти ҳудудий бошқармаси

Навоий вилояти ҳудудий бошқармаси

Наманган вилояти ҳудудий бошқармаси

Самарқанд вилояти ҳудудий бошқармаси

Сурхондарё вилояти ҳудудий бошқармаси

Сирдарё вилояти ҳудудий бошқармаси

Фарғона вилояти ҳудудий бошқармаси

Тошкент вилояти ҳудудий бошқармаси

Хоразм вилояти ҳудудий бошқармаси

Тошкент шаҳар ҳудудий бошқармаси""",
        "asosiyvazifalari": """Камбағалликни қисқартириш ва бандлик вазирлигининг асосий вазифалари:

1. меҳнат бозорини, банд ва ишсиз аҳолини таркибий таҳлил қилиш, ишсизларни манзилли аниқлаш ва уларнинг ҳисобини юритиш — меҳнат бозорини таҳлил қилиш ва ишсизларнинг ҳисобини манзилли (номма-ном) юритиш, иқтисодиётнинг ривожланиб келаётган тармоқ ва соҳаларида меҳнат ресурсларига бўлган талабни прогноз қилиш, меҳнат бозоридаги таркибий муаммоларни аниқлаш ва номутаносибликларнинг олдини олиш, Халқаро меҳнат ташкилоти билан фаол ҳамкорликда ишлаш

2. аҳоли бандлигини таъминлаш дастурларини шакллантириш, бўш иш ўринлари ҳисобини юритиш, ишсизларни ишга жойлаштириш — ҳар йил учун ҳудудлар, тармоқ ва соҳалар кесимида аҳоли бандлигини таъминлаш дастурини ишлаб чиқиш ва унинг амалга оширилишини мувофиқлаштириш, мавжуд бўш иш ўринлари ҳисобини юритиш ва мониторинг қилиш, ишсиз фуқароларни ишга жойлаштиришни ташкил этиш ва иш берувчилар билан боғлаш

3. камбағалликни қисқартириш — камбағаллик динамикаси ва таркибини таҳлил қилиш, оилаларни камбағалликдан чиқариш индивидуал режаларининг ишлаб чиқилишини ташкил этиш ва ижросини мувофиқлаштириш, аҳолини камбағалликдан чиқариш бўйича амалга оширилган ишларни жойларга чиққан ҳолда ўрганиш ҳамда натижаси бўйича “Камбағалликдан фаровонлик сари” дастурини амалга ошириш бўйича республика комиссиясига (кейинги ўринларда — Республика комиссияси) ҳар ойда маълумот киритиб бориш

4. ҳоким ёрдамчилари фаолиятини мувофиқлаштириш — маҳаллада тадбиркорликни ривожлантириш, аҳоли бандлигини таъминлаш ва камбағалликни қисқартириш масалалари бўйича туман (шаҳар) ҳокимининг ёрдамчиси (кейинги ўринларда — ҳоким ёрдамчиси) фаолиятини услубий жиҳатдан қўллаб-қувватлаш, истиқболли лойиҳалар билан ишлаш кўникмаси ва малакасини ошириб боришни доимий таҳлил қилиш, энг муҳим самарадорлик кўрсаткичларини ишлаб чиқиш ва баҳолаш, фаолиятида аниқланган тизимли муаммоларни бартараф этиш бўйича таклифлар ишлаб чиқиш

5. касбий стандартларни ишлаб чиқиш, касб-ҳунар ва хорижий тилларга ўқитиш, малакани баҳолаш — халқаро экспертларни жалб қилган ҳолда хорижда тан олинадиган касбий стандартларни ишлаб чиқиш, талаб юқори бўлган касб ва хорижий тилларга ўқитиш бўйича давлат буюртмасини шакллантириш, стандартлар асосида малакани баҳолаш хизматлари бозорини тартибга солиш, соҳага хусусий секторни кенг жалб қилиш

6. муносиб меҳнат шароитларини яратиш, меҳнат меъёрларига риоя этилишини ўрганиш, меҳнат ҳуқуқини таъминлаш ҳамда меҳнатни муҳофаза қилиш — муносиб меҳнат тамойиллари ва халқаро стандартларни жорий этиш, меҳнат муносабатларини тартибга солишнинг самарали механизмларини ишлаб чиқиш, меҳнат ҳуқуқларини ҳимоя қилиш, шунингдек, меҳнат хавфсизлиги ва гигиенаси ҳамда муносиб меҳнат шароитларини таъминлаш""",
        "hujjatlar": """📄Камбағалликни қисқартириш ва бандлик вазирлигининг фаолиятига доир асосий ҳужжатлар:

Камбағалликни қисқартириш ва бандлик соҳасида давлат сиёсатини такомиллаштириш ва самарадорликни ошириш чора-тадбирлари тўғрисида – ПҚ-347-сон (2024 йил 04 октабрь)
https://lex.uz/uz/docs/7131782

Камбағалликни қисқартириш ва аҳоли турмуш фаровонлигини ошириш борасидаги чора-тадбирларни янги босқичга олиб чиқиш тўғрисида –  ПФ-143-сон (2024 йил 23 сентабрь)
https://lex.uz/docs/7109857

Ўзбекистон Республикаси Камбағалликни қисқартириш ва бандлик вазирлиги томонидан қабул қилинган айрим идоравий норматив-ҳуқуқий ҳужжатларга ўзгартиришлар киритиш тўғрисида – Адлия вазирлиги томонидан рўйхатдан ўтказилган, рўйхат рақами 3667 (2025 йил 13 августь) 
https://lex.uz/ru/docs/7683552#7684476

Қорақалпоғистон Республикаси Жўқорғи Кенгеси, халқ депутатлари вилоят (туман, шаҳар) Кенгаши ҳузуридаги Камбағалликни қисқартириш билан боғлиқ масалалар бўйича комиссия тўғрисида НАМУНАВИЙ НИЗОМ – Олий Мажлиси Сенати Кенгашининг қарори КҚ-6-V-сон (2024 йил 29 ноябрь) 
https://lex.uz/uz/docs/7258833

Фуқароларнинг давлат пенсия таъминоти тўғрисида – ЎРҚ 938-XII-сон (1993 йил 03 сентабрь) 
https://lex.uz/acts/112314

Меҳнатни муҳофаза қилиш тўғрисида – ЎРҚ-410-сон (2016 йил 22 сентабрь) 
https://lex.uz/docs/3031427"""
    },
	"Олий таълим, фан ва инновациялар вазирлиги": {
        "tuzilmasi": """Олий таълим, фан ва инновациялар вазирлиги тизими:
Вазирликнинг марказий аппарати
Инновацион ривожланиш агентлиги
Билим ва малакаларни баҳолаш агентлиги
Олий аттестация комиссияси
Илғор технологиялар маркази
Инновацияларни жорий қилиш ва технологиялар трансфери миллий офиси
Илм-фанни молиялаштириш ва инновацияларни қўллаб-қувватлаш жамғармаси
«INNO» технопарк МЧЖ
Ёшлар академияси
Олий таълимни ривожлантириш тадқиқотлари маркази
Афғонистон фуқароларини ўқитиш таълим маркази
Олий таълим тизими кадрларини қайта тайёрлаш ва малакасини ошириш институти
Талаба ва ўқувчиларнинг ижтимоий фаоллигини ошириш маркази
Олий таълим муассасаларини ривожлантириш жамғармаси
Илмий-техник кенгашлар
Олий ва профессионал таълим муассасалари моддий-техник базасини мустаҳкамлаш маркази
Рақамли таълим технологияларини ривожлантириш маркази
Профессионал таълимни ривожлантириш институти
Қорақалпоғистон Республикаси Олий таълим, фан ва инновациялар вазирлиги, вилоятлар ҳамда Тошкент шаҳар олий таълим, фан ва инновациялар бошқармалари
давлат олий таълим муассасалари
профессионал таълим ташкилотлари""",
        "tizimidagitashkilotlar": """Олий таълим, фан ва инновациялар вазирлигининг тизимидаги ташкилотлар:

Рақамли таълим тeхнологияларини ривожлантириш маркази

Афғонистон фуқароларини ўқитиш таълим маркази

Инновацион ривожланиш агeнтлиги

Олий таълим тизими кадрларини қайта тайёрлаш ва малакасини ошириш институти

“Инно тeхнопарк” мчж “инно” инновацион ўқув-ишлаб чиқариш тeхнопарки

Талаба ва ўқувчиларнинг ижтимоий фаоллигини ошириш маркази

Билим ва малакаларни баҳолаш агeнтлиги

Инновацияларни жорий қилиш ва тeхнологиялар трансфeри миллий офиси

Олий ва профeссионал таълим муассасалари моддий-тeхник базасини мустаҳкамлаш маркази

Олий таълимни ривожлантириш тадқиқотлари маркази

Олий аттестация комиссияси

Илм-фанни молиялаштириш ва инновацияларни қўллаб-қувватлаш жамғармаси

Профессионал таълимни ривожлантириш институти""",
        "hududiyboshqarmalar": """📍Олий таълим, фан ва инновациялар вазирлигининг ҳудудий бошқармалари:

Қорақалпоғистон Республикаси Олий таълим, фан ва инновациялар вазирлиги

Андижон вилояти ҳудудий бошқармаси

Бухоро вилояти ҳудудий бошқармаси

Жиззах вилояти ҳудудий бошқармаси

Қашқадарё вилояти ҳудудий бошқармаси

Навоий вилояти ҳудудий бошқармаси

Наманган вилояти ҳудудий бошқармаси

Самарқанд вилояти ҳудудий бошқармаси

Сурхондарё вилояти ҳудудий бошқармаси

Сирдарё вилояти ҳудудий бошқармаси

Фарғона вилояти ҳудудий бошқармаси

Тошкент вилояти ҳудудий бошқармаси

Хоразм вилояти ҳудудий бошқармаси

Тошкент шаҳар ҳудудий бошқармаси""",
        "asosiyvazifalari": """Олий таълим, фан ва инновациялар вазирлигининг асосий вазифалари:

олий, ўрта махсус ва профессионал таълим соҳасида замонавий билим ва юксак маънавий-ахлоқий фазилатларга эга, мустақил фикрлайдиган юқори малакали ва рақобатбардош кадрлар тайёрлашга қаратилган ягона давлат сиёсатини амалга ошириш
замонавий ахборот-коммуникация технологиялари ва хорижий тилларни чуқур ўзлаштирган малакали кадрлар тайёрлашнинг юқори даражадаги сифатини таъминлаш
идоравий мансублигидан қатъи назар, барча олий, ўрта махсус ва профессионал таълим ташкилотлари фаолиятини мувофиқлаштириш, ўқув-педагогик ва илмий-услубий раҳбарликни амалга ошириш, мутахассислар тайёрлаш сифати, таълим мазмуни ва даражасини давлат таълим стандартлари ва малака талабларига мослигини таъминлаш
таълимнинг янги педагогик технологиялари ва ўқитиш услублари ҳамда халқаро илғор амалиётга асосланган таълим жараёнини ташкил этиш, таълим дастурларини (ўқув режалари ва фан дастурларини) такомиллаштириш, ўқитишнинг замонавий шакллари ва ахборот-коммуникация технология воситаларини жорий этган ҳолда таълим сифатини таъминлаш
олий, ўрта махсус ва профессионал таълимнинг маънавий-маърифий ишлар мазмунини такомиллаштириш, ёшларда ватанга садоқат, меҳр-оқибат, юксак масъулият, бағрикенглик, ҳуқуқий маданият, инновацион фикрлаш каби фазилатларни шакллантириш, ахборот-коммуникация технологияларидан оқилона фойдаланиш маданиятини ошириш ва ахборот хуружларига қарши мафкуравий иммунитетни мустаҳкамлаш ҳамда уларда ватан тараққиётига дахлдорлик ҳиссини уйғотиш
олий таълим ташкилотларида илмий-тадқиқот ишларини самарали ташкил этиш, тадқиқот натижаларини амалиётга кенг жорий этиш, илмий фаолиятни мамлакат ижтимоий-иқтисодий ривожлантириш истиқболларини ҳисобга олган ҳолда ташкил этиш, илмий ишланмаларни тижоратлаштириш, олий таълим, фан ва ишлаб чиқаришнинг ўзаро мустаҳкам интеграциясини таъминлаш, илмий-тадқиқот ишларига иқтидорли ёшларни кенг жалб этиш ҳамда уларни ҳар томонлама қўллаб-қувватлаш
таълим ташкилотларининг зиммасига юкланган вазифаларни юқори профессионал даражада бажаришга қодир раҳбар ва педагог кадрлар билан таъминлаш, уларни тизимли рағбатлантириш ҳамда узлуксиз касбий ривожланиши бўйича чораларни кўриш
Вазирлик, унинг тизимидаги ташкилотлар ва ҳудудий бошқармалар, олий, ўрта махсус ва профессионал таълим ташкилотларининг раҳбар ва педагог кадрларини қайта тайёрлаш ва малакасини оширишнинг узлуксиз тизимини ташкил этиш ва такомиллаштириш, уларнинг касбий маҳорати сифати ва даражасини мунтазам ошириб бориш учун шароитлар яратиш
олий, ўрта махсус ва профессионал таълим тизимини ҳамда илм-фан ва инновациялар соҳасини рақамлаштириш, замонавий ахборот-коммуникация технологияларини қўллаш орқали уларнинг ўқув, илмий, маъмурий ва молиявий жараёнларини автоматлаштириш
узоқ муддатли сценарийлар асосида устувор соҳа ва тармоқларга илм-фан ютуқларини татбиқ этиш ва мамлакатнинг инновацион ривожлантиришнинг стратегиясини ишлаб чиқиш
иқтисодиёт тармоқлари ва ижтимоий соҳадаги мавжуд муаммоларнинг илмий ечимини таъминлашга қаратилган илмий-тадқиқот ишларига давлат буюртмаси сиёсатини юритиш
республикада илмий ва инновацион фаолиятни мувофиқлаштириш
янги ишланмаларни тижоратлаштириш ва ишлаб чиқаришга жорий этиш, стартап лойиҳаларни амалга оширишни мувофиқлаштириш
илмий даражали кадрлар тайёрлашда яхлит давлат сиёсатини юритиш
илмий ва инновацион лойиҳаларни амалга оширишда инвестицияларни жалб этиш
олий, ўрта махсус ва профессионал таълим, илм-фан ва инновациялар соҳасида халқаро алоқаларни кенгайтириш ҳамда мустаҳкамлаш бўйича чора-тадбирларни амалга ошириш, соҳада эришилган ютуқларни халқаро миқёсда кенг ёритиш
таълим тизимида ўқув-тарбия жараёнлари, профессор-ўқитувчилар таркиби, кадрлар тайёрлаш ва уларнинг малакасини ошириш сифатини назорат қилиш, педагог кадрларга малака тоифаларини бериш бўйича давлат сиёсатини амалга ошириш
идоравий мансублиги ва ташкилий-ҳуқуқий шаклидан қатъи назар, ўрта махсус, профессионал, олий ва олий таълимдан кейинги таълимни, шунингдек, кадрлар малакасини ошириш ва уларни қайта тайёрлашни амалга оширувчи давлат ва нодавлат таълим ташкилотларини комплекс ва махсус давлат аккредитациясидан ўтказиш
идоравий мансублиги ва ташкилий-ҳуқуқий шаклидан қатъи назар, (хорижий таълим ташкилотлар ва уларнинг филиаллари ҳамда ҳарбийлашган таълим ташкилотлари бундан мустасно) давлат ва нодавлат олий, ўрта махсус ҳамда профессионал таълим ташкилотларининг миллий рейтингини юритиш
билим ва малакаларни баҳолаш бўйича умумий сиёсатни белгилаш
Вазирлик тизимидаги олий, ўрта махсус ташкилотлари ҳамда бошқа ташкилотларни молиялаштириш, моддий-техник базасини ривожлантириш, шунингдек, уларнинг молиявий фаолияти устидан назоратни амалга ошириш
олий малакали илмий ва илмий-педагог кадрларни аттестациядан ўтказиш соҳасида ягона давлат сиёсатини амалга ошириш, ушбу фаолиятни ташкил этиш, назорат қилиш ва мувофиқлаштириш
аҳоли орасида хорижий тилларни ўрганишни оммалаштириш ва уларни мукаммал ўзлаштириш учун зарур шароитлар яратиш, хорижий тилларни ўқитишнинг халқаро тан олинган дастур ва дарсликлари таълимнинг барча босқичларида жорий этилишини мувофиқлаштириш ҳамда профессор-ўқитувчиларда замонавий ўқитиш кўникмаларини ривожлантириш
нодавлат таълим ташкилотларига лицензиялар бериш фаолиятини хабардор қилиш тартибида амалга оширадиган шахслардан хабарномалар қабул қилиш ва уларнинг реестрини юритиш.""",
        "hujjatlar": """📄Олий таълим, фан ва инновациялар вазирлигининг фаолиятига доир асосий ҳужжатлар:

Ўзбекистон Республикаси Олий таълим, фан ва инновациялар вазирлиги тўғрисида НИЗОМ –ВМҚ 489-сон (2024 йил 08 августь)
https://lex.uz/docs/7054560

Ўзбекистон Республикаси Олий таълим, фан ва инновациялар вазирлиги ҳузуридаги Касбий таълимни ривожлантириш жамғармаси тўғрисида НИЗОМ – ВМҚ 245-сон (2025 йил 19 апрель)
https://lex.uz/docs/7485096

Педагогнинг мақоми тўғрисида – ЎРҚ-901-сон (2024 йил 01 февраль)
https://lex.uz/docs/6786401

Таълим тўғрисида – ЎРҚ-637-сон (2020 йил 23 августь)
https://lex.uz/en/docs/5013007

Олий таълим ташкилотларига ўқишга қабул қилиш ва давлат буюртмасини жойлаштириш тизимини такомиллаштириш тўғрисида – ПФ-81-сон (2024 йил 24 май)
https://lex.uz/docs/6937332

Олий ва профессионал таълим ташкилотлари талабалари ва ўқувчиларига бюджет маблағлари ҳисобидан таълим кредитини ажратиш тартибини такомиллаштириш тўғрисида – ПФ-82-сон (2024 йил 27 май)
https://lex.uz/docs/6940854"""
    },
	"Мактабгача ва мактаб таълими вазирлиги": {
        "tuzilmasi": """Мактабгача ва мактаб таълими вазирлиги тизими:

Республика таълим маркази

А. Авлоний номидаги педагогик маҳорат миллий институти

Бошланғич таълим журнали таҳририяти давлат корхонаси, 

Тил ва адабиёт таълими, Преподавание языка и литературы, Lаnguаge аnd literаture teаching журналлари таҳририяти давлат корхонаси

Маърифат ва Учитель Узбекистана газеталари таҳририяти

Халқ таълими журнали таҳририяти давлат корхонаси 

Тонг юлдузи газетаси таҳририяти 

Класс газетаси таҳририяти 

Ғунча журнали таҳририяти 

Гулхан журнали таҳририяти

Ilk Qadam (IQ) журнали таҳририяти ДУК

Таъминот ва логистика хизмати ДУК

Низомий номидаги Тошкент давлат педагогика университети ва унинг ҳузуридаги академик лицей 

Тошкент шаҳридаги А.И. Герцен номидаги Россия давлат педагогика университети Федерал давлат бюджети олий таълим муассасаси филиали

Тошкент шаҳридаги Пучон университети

Олий таълим муассасалари педагог кадрларини қайта тайёрлаш ва уларнинг малакасини ошириш тармоқ маркази

Наманган ва Хўжайли хизмат кўрсатиш ва сервис техникумлари

Қори Ниёзий номидаги Тарбия педагогикаси миллий институти ва унинг Қорақалпоғистон Республикаси филиали, педагогика коллежлари, экспериментал давлат мактабгача таълим ташкилотлари, нодавлат мактабгача таълим ташкилотлари

Мактабгача таълим ташкилотлари директор ва мутахассисларини қайта тайёрлаш ва уларнинг малакасини ошириш институти

Ахборот ва педагогика технологиялари инновацион маркази МЧЖ

Педагогик маҳорат марказлари

Ўзбекистон нашриёт-матбаа ижодий уйи МЧЖ, Ғафур Ғулом номидаги нашриёт-матбаа ижодий уйи МЧЖ

Ўқувчиларни касб-ҳунарга йўналтириш ва психологик-педагогик республика ташхис маркази

Имкон реабилитация марказига эга давлат кўп тармоқли ихтисослаштирилган мактабгача таълим ташкилотлари*, Меҳрли мактаб давлат таълим муассасаси, Республика соғломлаштириш оромгоҳи

Баркамол авлод республика болалар мактаби

Республика ўқувчи ёшлар маркази

Ўзбекистон Ёшлик жисмоний тарбия ва спорт жамияти

Ихтисослаштирилган лойиҳа-изланиш институти

Республика ўғил болалар ўқув-тарбия муассасаси*, Республика қиз болалар ўқув-тарбия муассасаси*

Жаҳон банки билан ҳамкорликда Болаларни эрта ёшдан ривожлантиришни такомиллаштириш лойиҳасини амалга ошириш гуруҳи

Таълим соҳасидаги ислоҳотларга кўмаклашиш жамғармаси

Ихтисослаштирилган таълим муассасалари агентлиги

Қорақалпоғистон Республикаси Мактабгача ва мактаб таълими вазирлиги, вилоятлар ва Тошкент шаҳар мактабгача ва мактаб таълими бошқармалари

Ҳудудий бошқармалар тасарруфидаги умумий ўрта ва мактабдан ташқари таълим муассасалари

Қорақалпоғистон Республикаси Таълим маркази

Болалар кутубхоналари

Туман (шаҳар) мактабгача ва мактаб таълими бўлимлари

Умумий ўрта таълим ташкилотлари

Мактабгача таълим ташкилотлари

Мактабдан ташқари таълим ташкилотлари""",
        "tizimidagitashkilotlar": """Мактабгача ва мактаб таълими вазирлигининг тизимидаги ташкилотлар:

А. Авлоний номидаги Педагогларни касбий ривожлантириш ва янги методикаларга ўргатиш миллий-тадқиқот институти

Республика таълим маркази директори

Психологик-педагогик Республика ташхис маркази

Республика Баркамол авлод болалар мактаби

Ихтисослаштирилган таълим муассасалари агентлиги""",
        "hududiyboshqarmalar": """📍Мактабгача ва мактаб таълими вазирлигининг ҳудудий бошқармалари:

Қорақалпоғистон Республикаси бошқармаси

Андижон вилояти бошқармаси

Бухоро ҳудудий бошқармаси

Жиззах вилояти бошқармаси

Қашқадарё вилояти бошқармаси

Навоий вилояти бошқармаси

Наманган вилояти бошқармаси

Самарқанд вилояти бошқармаси

Сурхондарё вилояти бошқармаси

Сирдарё вилояти бошқармаси

Фарғона вилояти бошқармаси

Тошкент вилояти бошқармаси

Хоразм вилояти бошқармаси

Тошкент шаҳар бошқармаси""",
        "asosiyvazifalari": """Мактабгача ва мактаб таълими вазирлигининг асосий вазифалари:
а) мактабгача, умумий ўрта ва мактабдан ташқари таълим соҳасида ягона давлат сиёсатини ишлаб чиқиш ва амалга ошириш, ўқув ва тарбия жараёнларининг ўзаро мустаҳкам алоқаси ва узлуксизлигини таъминлаш;
б) ўқув ва тарбия жараёнига халқаро талаблар асосида ишлаб чиқилган ўқув режа, дастур ва ўқув-методик мажмуалар ва замонавий педагогик технологияларни жорий қилиш;
в) ўқувчилар ва тарбияланувчиларни умуминсоний қадриятлар, юксак маънавият, ватанпарварлик ва инсонпарварлик руҳида тарбиялаш, уларнинг қалби ва онгига мустақиллик ғояларини янада чуқур сингдириш ҳамда ёт ғояларга қарши иммунитетини шакллантириш;
г) иқтидорли ёшларни аниқлаш, саралаб олиш ва уларнинг ҳар томонлама ривожланиши учун зарур шарт-шароитларни яратиш, ўқувчиларнинг умумтаълим фанлари бўйича халқаро олимпиадалар, танловлар ва мусобақаларда муносиб иштирокини таъминлаш;
д) педагог кадрларнинг касбий билим ва кўникмаларини ошириш ва баҳолаш, мақоми ҳамда обрўсини мустаҳкамлаш, уларнинг моддий ва маънавий рағбатлантирилиши, шунингдек, ижтимоий муҳофаза қилинишини ташкил этиш;
е) мактабгача, умумий ўрта ва мактабдан ташқари таълим соҳасида нодавлат таълим хизматлари секторини янада қўллаб-қувватлаш, унинг ҳар томонлама ривожланиши учун қулай шарт-шароитлар яратиш;
ж) мактабгача, умумий ўрта ва мактабдан ташқари таълим жараёнларини рақамлаштириш ва мазкур соҳалардаги давлат хизматларини кенгайтириш;
з) мактабгача, умумий ўрта ва мактабдан ташқари таълим (шу жумладан, чет тилларини ўргатиш) соҳасида лицензиялаш, рухсат бериш ва хабардор қилиш тартиб-таомилларини амалга ошириш, мазкур йўналишда фаолият юритаётган таълим ташкилотлар томонидан сифатли таълим берилишини таъминлаш""",
        "hujjatlar": """📄 Мактабгача ва мактаб таълими вазирлигининг фаолиятига доир асосий ҳужжатлар:

Мактабгача ва мактаб таълими вазирлиги ҳамда унинг тизимидаги ташкилотлар фаолиятини самарали ташкил этиш чора-тадбирлари тўғрисида – ПФ-79-сон (2023 йил 26 май)
https://lex.uz/docs/6476175

Мактабгача ва мактаб таълими вазирлиги, унинг тизимидаги агентлик ҳамда марказлар, ҳудудий ва туман (шаҳар) бўлинмалари ходимларини қўшимча рағбатлантириш шартлари – ПФ-51-сон (2025 йил 19 март)
https://lex.uz/docs/7438953

Мактабгача ва мактаб таълими вазирининг жамғармаси тўғрисида НИЗОМ – ВМҚ 425-сон (2022 йил 02 августь)
https://lex.uz/uz/docs/6143326

Ўзбекистон Республикаси Мактабгача ва мактаб таълими вазирлиги ҳузуридаги Ихтисослаштирилган таълим муассасалари агентлиги тизимидаги ихтисослаштирилган спорт мактаблари тўғрисида НИЗОМ – ВМҚ 524-сон (2025 йил 20 августь)
https://lex.uz/docs/7692964"""
    },
	"Транспорт вазирлиги": {
        "tuzilmasi": "🚆 Темир йўл, автомобиль, авиация департаментлари.",
        "tizimidagitashkilotlar": "✈️ Ўзтемирйўл, Ўзавиа, аэропорт дирекцияси.",
        "hududiyboshqarmalar": "📍 Вилоят транспорт бошқармалари.",
        "asosiyvazifalari": "🚗 Инфратузилмани ривожлантириш, хавфсизлик.",
        "hujjatlar": "📄 ПҚ-4648 (2020 йил 13 февраль)."
    },
	"Транспорт вазирлиги": {
        "tuzilmasi": "🚆 Темир йўл, автомобиль, авиация департаментлари.",
        "tizimidagitashkilotlar": "✈️ Ўзтемирйўл, Ўзавиа, аэропорт дирекцияси.",
        "hududiyboshqarmalar": "📍 Вилоят транспорт бошқармалари.",
        "asosiyvazifalari": "🚗 Инфратузилмани ривожлантириш, хавфсизлик.",
        "hujjatlar": "📄 ПҚ-4648 (2020 йил 13 февраль)."
    },
	"Транспорт вазирлиги": {
        "tuzilmasi": "🚆 Темир йўл, автомобиль, авиация департаментлари.",
        "tizimidagitashkilotlar": "✈️ Ўзтемирйўл, Ўзавиа, аэропорт дирекцияси.",
        "hududiyboshqarmalar": "📍 Вилоят транспорт бошқармалари.",
        "asosiyvazifalari": "🚗 Инфратузилмани ривожлантириш, хавфсизлик.",
        "hujjatlar": "📄 ПҚ-4648 (2020 йил 13 февраль)."
    },
	"Транспорт вазирлиги": {
        "tuzilmasi": "🚆 Темир йўл, автомобиль, авиация департаментлари.",
        "tizimidagitashkilotlar": "✈️ Ўзтемирйўл, Ўзавиа, аэропорт дирекцияси.",
        "hududiyboshqarmalar": "📍 Вилоят транспорт бошқармалари.",
        "asosiyvazifalari": "🚗 Инфратузилмани ривожлантириш, хавфсизлик.",
        "hujjatlar": "📄 ПҚ-4648 (2020 йил 13 февраль)."
    },
	"Транспорт вазирлиги": {
        "tuzilmasi": "🚆 Темир йўл, автомобиль, авиация департаментлари.",
        "tizimidagitashkilotlar": "✈️ Ўзтемирйўл, Ўзавиа, аэропорт дирекцияси.",
        "hududiyboshqarmalar": "📍 Вилоят транспорт бошқармалари.",
        "asosiyvazifalari": "🚗 Инфратузилмани ривожлантириш, хавфсизлик.",
        "hujjatlar": "📄 ПҚ-4648 (2020 йил 13 февраль)."
    },
	"Транспорт вазирлиги": {
        "tuzilmasi": "🚆 Темир йўл, автомобиль, авиация департаментлари.",
        "tizimidagitashkilotlar": "✈️ Ўзтемирйўл, Ўзавиа, аэропорт дирекцияси.",
        "hududiyboshqarmalar": "📍 Вилоят транспорт бошқармалари.",
        "asosiyvazifalari": "🚗 Инфратузилмани ривожлантириш, хавфсизлик.",
        "hujjatlar": "📄 ПҚ-4648 (2020 йил 13 февраль)."
    },
	"Транспорт вазирлиги": {
        "tuzilmasi": "🚆 Темир йўл, автомобиль, авиация департаментлари.",
        "tizimidagitashkilotlar": "✈️ Ўзтемирйўл, Ўзавиа, аэропорт дирекцияси.",
        "hududiyboshqarmalar": "📍 Вилоят транспорт бошқармалари.",
        "asosiyvazifalari": "🚗 Инфратузилмани ривожлантириш, хавфсизлик.",
        "hujjatlar": "📄 ПҚ-4648 (2020 йил 13 февраль)."
    },
}

# 🧮 Статистика маълумотлари
user_count = set()
vazirlik_stat = {k: 0 for k in malumotlar.keys()}

# 🧾 /start буйруғи
async def start(update: Update, context: ContextTypes.DEFAULT_TYPE):
    user_id = update.message.from_user.id
    user_count.add(user_id)

    keyboard = ReplyKeyboardMarkup(vazirliklar, resize_keyboard=True)
    await update.message.reply_text(
        "🇺🇿 Салом! Қуйидаги вазирликлардан бирини танланг:",
        reply_markup=keyboard
    )

# 💬 Вазирлик танланганда
async def handle_message(update: Update, context: ContextTypes.DEFAULT_TYPE):
    matn = update.message.text.strip()
    user_id = update.message.from_user.id

    if matn in malumotlar:
        vazirlik_stat[matn] += 1
        context.user_data["vazirlik"] = matn

        keyboard = get_vazirlik_keyboard()
        await update.message.reply_text(
            f"🏛 {matn}\n\nҚуйидаги бўлимлардан бирини танланг:",
            reply_markup=keyboard
        )
    else:
        await update.message.reply_text("Илтимос, рўйхатдан вазирликни танланг.")

# 🧩 Функция: бўлимлар тугмалари
def get_vazirlik_keyboard():
    return InlineKeyboardMarkup([
        [
            InlineKeyboardButton("🏗 Тузилмаси", callback_data="tuzilmasi"),
            InlineKeyboardButton("🏢 Тизимидаги ташкилотлар", callback_data="tizimidagitashkilotlar")
        ],
        [
            InlineKeyboardButton("📍 Ҳудудий бошқармалар", callback_data="hududiyboshqarmalar")
        ],
        [
            InlineKeyboardButton("🎯 Асосий вазифалари", callback_data="asosiyvazifalari"),
            InlineKeyboardButton("📄 Ҳужжатлар", callback_data="hujjatlar")
        ]
    ])

# 🎛 Inline тугмаларни бошқариш
async def button_handler(update: Update, context: ContextTypes.DEFAULT_TYPE):
    query = update.callback_query
    await query.answer()

    vazirlik = context.user_data.get("vazirlik")

    if not vazirlik:
        await query.edit_message_text("Илтимос, аввал вазирликни танланг.")
        return

    # 🔙 Орқага қайтиш — бўлимлар менюсига қайтади
    if query.data == "back":
        keyboard = get_vazirlik_keyboard()
        await query.edit_message_text(
            f"🏛 {vazirlik}\n\nҚуйидаги бўлимлардан бирини танланг:",
            reply_markup=keyboard
        )
        return

    # 🔹 Агар маълумот бўлими танланган бўлса
    malumot = malumotlar[vazirlik].get(query.data, "Маълумот топилмади.")

    keyboard = InlineKeyboardMarkup([
        [InlineKeyboardButton("⬅️ Орқага қайтиш", callback_data="back")]
    ])

    await query.edit_message_text(
        f"🏛 {vazirlik}\n\n{malumot}",
        reply_markup=keyboard
    )

# 👑 Admin panel
async def admin_panel(update: Update, context: ContextTypes.DEFAULT_TYPE):
    user_id = update.message.from_user.id
    if user_id != ADMIN_ID:
        await update.message.reply_text("⛔ Бу буйруқ фақат админ учун.")
        return

    text = "📊 <b>Admin panel:</b>\n\n"
    text += f"👥 Фойдаланувчилар сони: <b>{len(user_count)}</b>\n\n"
    text += "🏛 Вазирликлар бўйича статистика:\n"
    for v, c in vazirlik_stat.items():
        text += f"— {v}: <b>{c}</b> марта очилган\n"

    await update.message.reply_html(text)

# 🤖 Ботни ишга туширамиз
app = ApplicationBuilder().token(TELEGRAM_TOKEN).build()
app.add_handler(CommandHandler("start", start))
app.add_handler(CommandHandler("admin", admin_panel))
app.add_handler(MessageHandler(filters.TEXT & ~filters.COMMAND, handle_message))
app.add_handler(CallbackQueryHandler(button_handler))

print("🤖 Бот ишлаяпти — 'Орқага қайтиш' бўлим менюсига қайтади!")
app.run_polling()
